rails/app/controllers/home_controller.rb

SELECT  "temperatures".* FROM "temperatures" ORDER BY "temperatures"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @temperature = Temperature.last